# RebarSpliceOptions Class

---
This class encapsulates the options for the rebar splice operation.
SystemObject Autodesk.Revit.DB.StructureRebarSpliceOptions
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RebarSpliceOptions : IDisposable

    Public Class RebarSpliceOptions
    	Implements IDisposable

    public ref class RebarSpliceOptions : IDisposable

    type RebarSpliceOptions =
        class
            interface IDisposable
        end
The RebarSpliceOptions type exposes the following members.
| Name| Description
---|---|---
| RebarSpliceOptions|  Constructs a RebarSpliceOptions
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| SplicePosition|  Identifies the splice line position.
| SpliceTypeId|  Identifies the id of the Rebar Splice Type.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the RebarSpliceOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace